	@ stm32f030f4p6 asm 
	 .thumb                 
         .syntax unified
.section .data	
        	.equ STACKINIT,          0x20000300
		.equ shumaguanma,	0x20000000
shumaguanmabiao:	.int 0xfc,0x50,0xea,0xf2,0x56,0xb6,0xbe,0xd0,0xfe,0xfa

	
zhengxianbiao:
	.short 	  512,   515,   518,   521,   524,   527,   530,   533,   537,   540,   543,   546,   549,   552,   555,   559,   562,   565,   568,   571,   574,   577,   580,   584,   587,   590,   593,   596,   599,   602,   605,   608,   611,   614,   618,   621,   624,   627,   630,   633,   636,   639,   642,   645,   648,   651,   654,   657,   660,   663,   666,   669,   672,   675,   678,   681,   684,   687,   690,   693,   696,   699,   702,   705,   707,   710,   713,   716,   719,   722,   725,   728,   730,   733,   736,   739,   742,   745,   747,   750,   753,   756,   758,   761,   764,   767,   769,   772,   775,   777,   780,   783,   785,   788,   791,   793,   796,   799,   801,   804,   806,   809,   811,   814,   816,   819,   822,   824,   826,   829,   831,   834,   836,   839,   841,   844,   846,   848,   851,   853,   855,   858,   860,   862,   865,   867,   869,   871,   874,   876,   878,   880,   882,   884,   887,   889,   891,   893,   895,   897,   899,   901,   903,   905,   907,   909,   911,   913,   915,   917,   919,   921,   923,   925,   926,   928,   930,   932,   934,   935,   937,   939,   941,   942,   944,   946,   947,   949,   951,   952,   954,   955,   957,   959,   960,   962,   963,   965,   966,   967,   969,   970,   972,   973,   974,   976,   977,   978,   980,   981,   982,   983,   985,   986,   987,   988,   989,   990,   991,   993,   994,   995,   996,   997,   998,   999,  1000,  1001,  1001,  1002,  1003,  1004,  1005,  1006,  1007,  1007,  1008,  1009,  1010,  1010,  1011,  1012,  1012,  1013,  1014,  1014,  1015,  1015,  1016,  1016,  1017,  1017,  1018,  1018,  1019,  1019,  1020,  1020,  1020,  1021,  1021,  1021,  1022,  1022,  1022,  1022,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1023,  1022,  1022,  1022,  1022,  1021,  1021,  1021,  1020,  1020,  1020,  1019,  1019,  1018,  1018,  1017,  1017,  1016,  1016,  1015,  1015,  1014,  1014,  1013,  1012,  1012,  1011,  1010,  1010,  1009,  1008,  1007,  1007,  1006,  1005,  1004,  1003,  1002,  1001,  1001,  1000,   999,   998,   997,   996,   995,   994,   993,   991,   990,   989,   988,   987,   986,   985,   983,   982,   981,   980,   978,   977,   976,   974,   973,   972,   970,   969,   967,   966,   965,   963,   962,   960,   959,   957,   955,   954,   952,   951,   949,   947,   946,   944,   942,   941,   939,   937,   935,   934,   932,   930,   928,   926,   925,   923,   921,   919,   917,   915,   913,   911,   909,   907,   905,   903,   901,   899,   897,   895,   893,   891,   889,   887,   884,   882,   880,   878,   876,   874,   871,   869,   867,   865,   862,   860,   858,   855,   853,   851,   848,   846,   844,   841,   839,   836,   834,   831,   829,   826,   824,   822,   819,   816,   814,   811,   809,   806,   804,   801,   799,   796,   793,   791,   788,   785,   783,   780,   777,   775,   772,   769,   767,   764,   761,   758,   756,   753,   750,   747,   745,   742,   739,   736,   733,   730,   728,   725,   722,   719,   716,   713,   710,   707,   705,   702,   699,   696,   693,   690,   687,   684,   681,   678,   675,   672,   669,   666,   663,   660,   657,   654,   651,   648,   645,   642,   639,   636,   633,   630,   627,   624,   621,   618,   614,   611,   608,   605,   602,   599,   596,   593,   590,   587,   584,   580,   577,   574,   571,   568,   565,   562,   559,   555,   552,   549,   546,   543,   540,   537,   533,   530,   527,   524,   521,   518,   515,   511,   508,   505,   502,   499,   496,   493,   490,   486,   483,   480,   477,   474,   471,   468,   464,   461,   458,   455,   452,   449,   446,   443,   439,   436,   433,   430,   427,   424,   421,   418,   415,   412,   409,   405,   402,   399,   396,   393,   390,   387,   384,   381,   378,   375,   372,   369,   366,   363,   360,   357,   354,   351,   348,   345,   342,   339,   336,   333,   330,   327,   324,   321,   318,   316,   313,   310,   307,   304,   301,   298,   295,   293,   290,   287,   284,   281,   278,   276,   273,   270,   267,   265,   262,   259,   256,   254,   251,   248,   246,   243,   240,   238,   235,   232,   230,   227,   224,   222,   219,   217,   214,   212,   209,   207,   204,   201,   199,   197,   194,   192,   189,   187,   184,   182,   179,   177,   175,   172,   170,   168,   165,   163,   161,   158,   156,   154,   152,   149,   147,   145,   143,   141,   139,   136,   134,   132,   130,   128,   126,   124,   122,   120,   118,   116,   114,   112,   110,   108,   106,   104,   102,   100,    98,    97,    95,    93,    91,    89,    88,    86,    84,    82,    81,    79,    77,    76,    74,    72,    71,    69,    68,    66,    64,    63,    61,    60,    58,    57,    56,    54,    53,    51,    50,    49,    47,    46,    45,    43,    42,    41,    40,    38,    37,    36,    35,    34,    33,    32,    30,    29,    28,    27,    26,    25,    24,    23,    22,    22,    21,    20,    19,    18,    17,    16,    16,    15,    14,    13,    13,    12,    11,    11,    10,     9,     9,     8,     8,     7,     7,     6,     6,     5,     5,     4,     4,     3,     3,     3,     2,     2,     2,     1,     1,     1,     1,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     0,     1,     1,     1,     1,     2,     2,     2,     3,     3,     3,     4,     4,     5,     5,     6,     6,     7,     7,     8,     8,     9,     9,    10,    11,    11,    12,    13,    13,    14,    15,    16,    16,    17,    18,    19,    20,    21,    22,    22,    23,    24,    25,    26,    27,    28,    29,    30,    32,    33,    34,    35,    36,    37,    38,    40,    41,    42,    43,    45,    46,    47,    49,    50,    51,    53,    54,    56,    57,    58,    60,    61,    63,    64,    66,    68,    69,    71,    72,    74,    76,    77,    79,    81,    82,    84,    86,    88,    89,    91,    93,    95,    97,    98,   100,   102,   104,   106,   108,   110,   112,   114,   116,   118,   120,   122,   124,   126,   128,   130,   132,   134,   136,   139,   141,   143,   145,   147,   149,   152,   154,   156,   158,   161,   163,   165,   168,   170,   172,   175,   177,   179,   182,   184,   187,   189,   192,   194,   197,   199,   201,   204,   207,   209,   212,   214,   217,   219,   222,   224,   227,   230,   232,   235,   238,   240,   243,   246,   248,   251,   254,   256,   259,   262,   265,   267,   270,   273,   276,   278,   281,   284,   287,   290,   293,   295,   298,   301,   304,   307,   310,   313,   316,   318,   321,   324,   327,   330,   333,   336,   339,   342,   345,   348,   351,   354,   357,   360,   363,   366,   369,   372,   375,   378,   381,   384,   387,   390,   393,   396,   399,   402,   405,   409,   412,   415,   418,   421,   424,   427,   430,   433,   436,   439,   443,   446,   449,   452,   455,   458,   461,   464,   468,   471,   474,   477,   480,   483,   486,   490,   493,   496,   499,   502,   505,   508
	
	
	
.section .text
vectors:        
        .word STACKINIT         
        .word _start + 1        
        .word _nmi_handler + 1  
        .word _hard_fault  + 1  
        .word 0 
        .word 0    
        .word 0
	.word 0
	.word 0
	.word 0
	.word 0
	.word _svc_handler +1
	.word 0 
	.word 0
	.word _pendsv_handler +1
	.word _systick +1               @ 15   
	.word 0     @ _wwdg +1          @ 0
	.word 0     @_pvd +1            @ 1
	.word 0     @_rtc +1            @ 2
	.word 0     @_flash +1          @ 3
	.word 0     @ _rcc + 1          @ 4
	.word 0      @_exti0_1  +1      @ 5
	.word 0      @ _exti2_3 +1      @ 6
	.word 0       @_exti4_15 +1     @ 7
	.word 0                         @ 8
	.word 0         @_dma1_1  +1    @ 9
	.word 0    @_dma1_2_3 +1        @ 10
	.word 0       @_dma1_4_5 +1     @ 11
	.word 0      @_adc1 +1          @ 12
	.word 0       @_tim1_brk_up +1  @ 13
	.word 0        @ _tim1_cc +1    @ 14
	.word 0         @_tim2 +1       @ 15
	.word 0          @_tim3 +1      @ 16
	.word 0                         @ 17
	.word 0		                @ 18
	.word _tim14 +1    @ 19
	.word 0                         @ 20
	.word 0         @_tim16 +1      @ 21
	.word 0         @_tim17 +1      @ 22
	.word 0          @_i2c   +1     @ 23
	.word 0                         @ 24
	.word 0           @_spi   +1    @ 25
	.word 0                         @ 26
	.word 0         @_usart1 +1     @ 27
	
_start:
shizhong:
	ldr r0, = 0x40021000 @ rcc
	ldr r2, = 0x40022000   @FLASH访问控制
	movs r1, # 0x32
	str r1, [r2]           @FLASH缓冲 缓冲开启
	ldr r1, = 0x310002     @HSE-PLL 6
	str r1, [r0, # 0x04]
	ldr r1, = 0x1090001
	str r1, [r0]
dengrc:
	ldr r1, [r0]
	lsls r1, # 30
	bpl dengrc
dengjingzhen:
	ldr r1, [r0]
	lsls r1, # 14
	bpl dengjingzhen
dengpll:
	ldr r1, [r0]
	lsls r1, # 6
	bpl dengpll
	@0x34时钟控制寄存器 2 (RCC_CR2)
	movs r1, # 0x01
	str r1, [r0, # 0x34]  @ HSI开14M时钟
dengdai14mshizhongwending:
	ldr r1, [r0, # 0x34]
	lsls r1, r1, # 30     @ 左移30位
	bpl dengdai14mshizhongwending  @ 等待14M时钟稳定
waisheshizhong:	 @ 外设时钟              
	@+0x14 #0(DMA),2(SRAM),4(FLITF),6(CRC),17(PA)
	@18(PB),19(PC),20(PD),22(PF)
	@+0x18 #0(SYSCFG),5(USART6),9(ADC),#11(TIM1)
	@12(SPI), @14(USART1),16(TIM15),17(TIM16),
	@18(TIM17),22(DBGMCU)
	@+0X1C # 1(TIM3),4(TIM6),5(TIM7),8(TIM14),11(WWDG),
	@14(SPI2),17(USART2),18(USART3),19(USART4),20(USART5)
	@21(I2C1),22(I2C2),23(USB),28(PWR)
	ldr r0, = 0x40021000
	ldr r1, = 0x60005
	str r1, [r0, # 0x14]
	ldr r1, = 0x100
	str r1, [r0, # 0x1c]
	ldr r1, = 0x800
	str r1, [r0, # 0x18]

waishezhongduan:	@外设中断
	@0xE000E100    0-31 写1开，写0没效
	@0XE000E180    0-31 写1关，写0没效
	@0XE000E200    0-31 挂起，写0没效
	@0XE000E280    0-31 清除， 写0没效
systick:
	@ 0xe000ed20 30-31 优先级
	ldr r0, = 0xe000e010
	ldr r1, = 47999 @ 重载数
	str r1, [r0, # 4] @ 写入重载数
	str r1, [r0, # 8] @ 清除当前数
	movs r1, # 0
	str r1, [r0] @ 开定时器

dmachushihua:
	@+0=LSR,+4=IFCR,
	@+8=CCR1,+c=CNDTR1,+10=CPAR1+14=CMAR1,
	@+1c=CCR2,+20=CNDTR2,+24=CPAR2,+28=CMAR2
	@+30=CCR3,+34=CNDTR3,+38=CPAR2,+3c=CMAR3
	@+44=CCR4,+48=CNDTR4,+4c=CPAR4,+50=CMAR4
	@+58=CCR5,+5c=CNDTR5,+60=CPAR5,+64=CMAR5
	@+6C=CCR6,+70=CNDTR6,+74=CPAR6,+78=CMAR6
	@+80=CCR7,+84=CNDTR7,+88=CPAR7,+8c=CMAR7
	ldr r0, = 0x40020000
	ldr r1, = 0x40012c3c @ 外设地址
	str r1, [r0, # 0x60]
	ldr r1, = zhengxianbiao @ 储存器地址
	str r1, [r0, # 0x64]
	ldr r1, = 1024       @ 正弦点数
			     @10k=280
			     @1k=448
			     @100HZ= 1000
	str r1, [r0, # 0x5c]
	ldr r1, = 0x25b1         @ 21b1 8位到16位
		                 @ 25B1 16位到16位
	                         @储存到外设
	str r1, [r0, # 0x58]

tim1chushiha:
	ldr r0, = 0x40012c00 @ tim1_cr1
	movs r1, # 0
	str r1, [r0, # 0x28] @ psc
	ldr r1, = 1024         @ 10k=40
			     @ 1k=250
	str r1, [r0, # 0x2c] @ ARR
	ldr r1, = 0x60
	str r1, [r0, # 0x1c] @ ccmr2  CC3
	ldr r1, = 0xd00    @  CC3 互补
	str r1, [r0, # 0x20] @ ccer
	ldr r1, = 0x8000
	str r1, [r0, # 0x44] @ BDTR
	ldr r1, = 0x800 @ CC3 DMA
	str r1, [r0, # 0x0c] @ DIER
	ldr r1, = 0x81
	str r1, [r0]
	

	
io_she_zhi:
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
	@a(0x48000000)b(0x48000400)c(0x48000800)d(0x48000c00)f(0x48001400)
	@ 输入（00），通用输出（01），复用功能（10），模拟（11）
	@偏移0x4 = 端口输出类型 @ （0 推挽），（ 1 开漏）
	@偏移0x8 = 输出速度  00低速， 01中速， 11高速
	@偏移0xC = 上拉下拉 00无上下拉，  01 上拉， 10下拉
	@偏移0x10 = 输入数据寄存器
	@偏移0x14 = 输出数据寄存器
	@偏移0x18 = 端口开  0-15置位 
	@偏移0x28 = 端口关
	@0X20 = 复用低
	@GPIO口0（0-3位）每个IO口占用4位
	@ AF0 = 0X0000, AF1 = 0X0001, AF2 = 0X0010 AF3 = 0X0011, AF4 = 0X0100
	@ AF5 = 0X0101, AF6 = 0X0111, AF7 = 0X1000
	@0x24 = 复用高
	@GPIO口8 （0-3位）每个IO口占用4位
	@ AF0 = 0X0000, AF1 = 0X0001, AF2 = 0X0010 AF3 = 0X0011, AF4 = 0X0100
	@ AF5 = 0X0101, AF6 = 0X0111, AF7 = 0X1000
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
	ldr r0, = 0x48000000 @ gpio_a
	ldr r1, = 0x28205600 @ pa4
	str r1, [r0]
	ldr r1, [r0, # 0x08]
	ldr r2, = 0xfc00
	orrs r1, r2
	str r1, [r0, # 0x08]
	ldr r1, = 0x40000 @ tim14映射到PA4
	str r1, [r0, # 0x20] @ ARRL
	ldr r1, = 0x200     @ tim1_ch3到PA10
	str r1, [r0, # 0x24] @ ARRH
	ldr r0, = 0x48000400
	movs r1, # 0x08 @ pb1
	str r1, [r0]
	movs r1, # 0x20 @ tim1_ch3n到PB1
	str r1, [r0, # 0x20] @ ARRL


tingzhu:
	ldr r0, = 0x4002005c
	ldr r0, [r0]
	movs r1, # 8
	ldr r2, = shumaguanma
	bl zhuanshumaguanma
	movs r6, # 8
	lsls r6, # 2
	bl xieshumaguan
	b tingzhu

	zhuanshumaguanma:@ 16进制转数码管码
		@ R0要转的数据， R1长度，R2结果表首地址
	push {r0-r7,lr}
	ldr r7, = shumaguanmabiao
	movs r5, # 10
	mov r11, r5
xunhuanqiuma:
	mov r12, r0
	bl chufa
	mov r4, r12
	muls r4, r5
	mov r6, r4
	subs r3, r0, r6
	lsls r3, # 2
	ldr r6, [r7, r3]
	str r6, [r2]
	adds r2, r2, # 4
	mov r0, r12
	subs r1, # 1
	bne xunhuanqiuma
	pop {r0-r7,pc}
	
xieshumaguan: @ r6=位数 @数码管码
	push {r0-r7,lr}
	ldr r1, = 0x7f7f7f7f
	movs r2, # 0x01
	movs r7, # 0
	ldr r5, = shumaguanma
shumaguanshuaxin:
	ldr r3, [r5, r7]
	lsrs r4, r1, # 24
	lsls r4, r4, # 8
	orrs r4, r4, r3
	mov r12, r4
	bl xie595
	rors r1, r2
	adds  r7, r7, # 4
	cmp r7, r6
	bcc shumaguanshuaxin
	pop {r0-r7,pc}
	
xie595: @ R12=要写的数据
	push {r0-r7,lr}
	movs r0, # 0x40
	movs r7, # 0x80 
	movs r6, # 0x20 
	mov r5, r12
	movs r3, # 16   @16位
	ldr r2, = 0x48000000 @ gpioa
	movs r1, # 0x01
xunhuan595:
	str r6, [r2, # 0x18]
	bl yanshi
	tst r5, r1
	bne xie595_0
	str r7, [r2, # 0x28]
	b suocun595
xie595_0:
	str r7, [r2, # 0x18]
suocun595:
	bl yanshi
	lsrs r5, # 1
	str r6, [r2, # 0x28]
	bl yanshi
	subs r3, r3, # 1
	bne xunhuan595
	str r0, [r2, # 0x18]
	bl yanshi
	str r0, [r2, # 0x28]
	bl yanshi
	pop {r0-r7,pc}

yanshi:
	push {r0-r7,lr}
	ldr r0, = 10
yanshi1:
	subs r0, # 1
	bne yanshi1
	pop {r0-r7,pc}
	
chufa:	@软件除法
	@ r12 除以 R11
	push {r0-r7,lr}
	mov r6, r12
	cmp r6, # 0
	beq chufafanhui
	mov r7, r11
	cmp r7, # 0
	beq chufafanhui
	movs r0, # 0
chufaxunhuan:
	mov r12, r6
	bl jianceweishu
	mov r2, r12
	mov r12, r7
	bl jianceweishu
	mov r3, r12
	subs r2, r3, r2
	mov r4, r7
	lsls r4, r2
	mov r3, r4
	cmp r6, r3
	bcc dd1
	b dd2
dd1:
	subs r2, r2, # 1
	lsrs r3, # 1
dd2:
	subs r6, r6, r3
	movs r3, # 1
	lsls r3, r2
	orrs  r0, r3
	cmp r6, r7
	bcs chufaxunhuan
	mov r12, r0
chufafanhui:
	pop {r0-r7,pc}

jianceweishu:
	push {r0-r7,lr}
	movs r0, # 0
	mov r1, r12
jianceweishu1:
	bmi weishufanhui
	adds r0, r0, # 1
	lsls r1, # 1
	b jianceweishu1
weishufanhui:
	mov r12, r0
	pop {r0-r7,pc}

_nmi_handler:
	bx lr
_hard_fault:
	bx lr
_svc_handler:
	bx lr
_pendsv_handler:
	bx lr
_systick:
	push {r0-r7,lr}
	ldr r0, = 0x20000300
	ldr r1, [r0]
	adds r1, r1, # 1
	str r1, [r0]
	pop {r0-r7,pc}
_tim14:
tim14ting:
	bx lr
